In [2]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import sklearn

In [3]:
df = pd.read_excel('data.ods')
df

      name last name     city  age  income sex
0      ali    rezaii  hamedan   20    1300   m
1      mmd      mmdi   tehran   12     500   m
2     sama    rajabi   semnan   17     650   f
3     aria    jafari   semnan   18     900   m
4     reza   khalili      qom   19    1000   m
5     sara    danaii  mashhad   11     450   f
6     nilo  jafarpor   semnan   25    1500   f
7     amir    keyhan   tabriz   17     800   m
8    mahdi   bashiri  hamedan   25    1600   m
9   fateme     moafi   semnan   22    1350   f
10   sanaz     riahi     arak   26    1550   f

In [4]:
df.describe()

             age       income
count  11.000000    11.000000
mean   19.272727  1054.545455
std     5.021771   426.294819
min    11.000000   450.000000
25%    17.000000   725.000000
50%    19.000000  1000.000000
75%    23.500000  1425.000000
max    26.000000  1600.000000

In [5]:
msk = np.random.rand(len(df)) <0.8
train = df[msk]
test = df[~msk]
test

   name last name     city  age  income sex
0   ali    rezaii  hamedan   20    1300   m
3  aria    jafari   semnan   18     900   m
4  reza   khalili      qom   19    1000   m
6  nilo  jafarpor   semnan   25    1500   f
7  amir    keyhan   tabriz   17     800   m

In [1]:
regr= sklearn.linear_model.LinearRegression()
train.loc[:, 'sex'] = train['sex'].replace({'m': 1, 'f': 2}).astype(int)


# Prepare the training data
train_x = np.asanyarray(train[['age','sex']])
train_y = np.asanyarray(train[['income']])

# Fit the model
regr.fit(train_x, train_y)
print(regr.coef_)

NameError: name 'sklearn' is not defined

In [2]:
plt.scatter(train.age , train.income)
plt.plot(train_x , train_x *regr.coef_[0][0] + regr.intercept_[0] ,'r--')

NameError: name 'plt' is not defined

In [25]:
test.loc[:, 'sex'] = test['sex'].replace({'m': 1, 'f': 2}).astype(int)
test_x = np.asanyarray(test[['age','sex']])
test_y = np.asanyarray(test[['income']])
test_y_= regr.predict(test_x)
r2=sklearn.metrics.r2_score(test_y , test_y_)
r2

/tmp/ipykernel_320503/3158987417.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  test.loc[:, 'sex'] = test['sex'].replace({'m': 1, 'f': 2}).astype(int)

0.8442431491584905